// 1) задание
var Tf, Tc = 22;

Tf = (9 / 5) * Tc + 32;
alert(Tf);

// 2) задание
var int = 555.44483,
	str = "H3110 W0R1D",
	boo = true,
	nll = null,
	und,
	obj = {
		name: "Karl",
		age: 16,
		alive: false
	};

// 3) задание 
var admin, name;
name = "Василий";
admin = name;
console.log(admin);

// 4) задание, ответ: 1000108

// 5) задание. {
//	defer выполняет все скрипты последовательно после полной загрузки документа,
//	async выполняет скрипты по мере их загрузки, т. е. может делать это не последовательно;
//}